src_ext/DataProcessors/УЗ_РассылкаДолжникам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>УЗ_РассылкаДолжникам</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

src_ext/InformationRegisters/УЗ_ЖурналРассылки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>УЗ_ЖурналРассылки</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Отправлено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Адреса</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстОшибки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Вручную</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Вид</Name>
					<Type>
						<v8:Type>cfg:EnumRef.УЗ_ВидыСообщений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.УЗ_СтатусыСообщений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Источник</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.УЗ_Урок</v8:Type>
						<v8:Type>cfg:CatalogRef.УЗ_Абонемент</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Текст</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Ученик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_ФизЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Получатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_ФизЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Канал</Name>
					<Type>
						<v8:Type>cfg:EnumRef.УЗ_КаналыСообщений</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src_ext/DataProcessors/УЗ_РассылкаДолжникам/Forms/Форма/Ext/Form/Module.bsl
//Рассылка должникам: список должников по отбору (Обработки.УЗ_РассылкаДолжникам.Должники), текст письма с
//подстановками и предпросмотр по текущей строке, отправка отмеченным — фоновым заданием (форма доступна, в
//«Состоянии» — сколько ждём; результат — в колонке «Результат» строки). Правила повтора, согласия и суммы — на
//сервере в модуле менеджера обработки. Почта недоступна (безопасный режим, не настроена) — строка «Состояние»
//говорит почему и что сделать, «Отправить отмеченным» недоступна.

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	ПоУмолчанию = Обработки.УЗ_РассылкаДолжникам.ПараметрыПоУмолчанию();
	Организация = ПоУмолчанию.Организация;
	МинимальнаяСумма = ПоУмолчанию.МинимальнаяСумма;
	ДолгСтаршеДней = ПоУмолчанию.ДолгСтаршеДней;
	НеЧащеДней = ПоУмолчанию.НеЧащеДней;
	Тема = ПоУмолчанию.Тема;
	ТекстПисьма = ПоУмолчанию.Шаблон;
	Подстановки = НСтр("ru = 'Подстановки:'") + " " + Обработки.УЗ_РассылкаДолжникам.Подстановки();

КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)

	//сохранённые пустые тема и текст — берём текст по умолчанию (иначе ушло бы пустое письмо)
	Если ПустаяСтрока(ТекстПисьма) Тогда
		ТекстПисьма = Обработки.УЗ_РассылкаДолжникам.ШаблонПоУмолчанию();
	КонецЕсли;
	Если ПустаяСтрока(Тема) Тогда
		Тема = Обработки.УЗ_РассылкаДолжникам.ПараметрыПоУмолчанию().Тема;
	КонецЕсли;
	Если НеЧащеДней < 1 Тогда
		НеЧащеДней = 1;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)

	ЗаполнитьНаСервере();

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ОтборПриИзменении(Элемент)

	ЗаполнитьНаСервере();

КонецПроцедуры

&НаКлиенте
Процедура ШаблонПриИзменении(Элемент)

	ОбновитьПредпросмотр();

КонецПроцедуры

&НаКлиенте
Процедура ДолжникиПриАктивизацииСтроки(Элемент)

	ОбновитьПредпросмотр();

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Заполнить(Команда)

	ЗаполнитьНаСервере();

КонецПроцедуры

&НаКлиенте
Процедура Отправить(Команда)

	Если ЗначениеЗаполнено(ЗаданиеРассылки) Тогда
		Возврат;		//рассылка уже идёт
	КонецЕсли;
	Запуск = НачатьОтправкуНаСервере();
	Если Не ПустаяСтрока(Запуск.Ошибка) Тогда
		Состояние = Запуск.Ошибка;
		Возврат;
	КонецЕсли;
	Если Запуск.Результат <> Неопределено Тогда
		ПоказатьРезультат(Запуск.Результат, "");
		Возврат;
	КонецЕсли;
	ЗаданиеРассылки = Запуск.Задание;
	АдресРезультата = Запуск.АдресРезультата;
	НачалоОжидания = ТекущаяУниверсальнаяДатаВМиллисекундах();
	Элементы.ФормаОтправить.Доступность = Ложь;
	Состояние = НСтр("ru = 'Отправляем письма…'");
	ПодключитьОбработчикОжидания("ПроверитьЗаданиеРассылки", 1, Истина);

КонецПроцедуры

&НаКлиенте
Процедура ОткрытьЖурнал(Команда)

	ОткрытьФорму("РегистрСведений.УЗ_ЖурналРассылки.ФормаСписка", , ЭтотОбъект);

КонецПроцедуры

&НаКлиенте
Процедура ОтметитьВсех(Команда)

	Для Каждого СтрокаДолжника Из Должники Цикл
		СтрокаДолжника.Отметка = СтрокаДолжника.МожноПисать;
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура СнятьОтметки(Команда)

	Для Каждого СтрокаДолжника Из Должники Цикл
		СтрокаДолжника.Отметка = Ложь;
	КонецЦикла;

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

//Список должников на сейчас; отмечены те, кому можно писать (есть адрес с согласием, не писали недавно).
&НаСервере
Процедура ЗаполнитьНаСервере()

	Должники.Очистить();
	ПараметрыОтбора = Новый Структура("Организация, МинимальнаяСумма, ДолгСтаршеДней, НеЧащеДней",
		Организация, МинимальнаяСумма, ДолгСтаршеДней, НеЧащеДней);
	Для Каждого Должник Из Обработки.УЗ_РассылкаДолжникам.Должники(ПараметрыОтбора) Цикл
		СтрокаДолжника = Должники.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаДолжника, Должник);
		СтрокаДолжника.Отметка = Должник.МожноПисать;
		СтрокаДолжника.Результат = Должник.Причина;
	КонецЦикла;
	ОбновитьСостояние();
	ОбновитьПредпросмотрНаСервере();

КонецПроцедуры

//Строка «Состояние»: почему отправить нельзя (безопасный режим — с тем, как его снять; почта не настроена) или
//сколько должников и сколько отмечено.
&НаСервере
Процедура ОбновитьСостояние()

	Причина = Обработки.УЗ_РассылкаДолжникам.ПричинаНевозможностиОтправки();
	Элементы.ФормаОтправить.Доступность = ПустаяСтрока(Причина);
	Элементы.Состояние.ЦветТекста = ?(ПустаяСтрока(Причина), УЗ_ОбщийКлиентСервер.ЦветПояснения(),
		УЗ_ОбщийКлиентСервер.ЦветМинусаДенег());
	Если Не ПустаяСтрока(Причина) Тогда
		Состояние = Причина;
		Возврат;
	КонецЕсли;
	Можно = 0;
	Для Каждого СтрокаДолжника Из Должники Цикл
		Можно = Можно + ?(СтрокаДолжника.МожноПисать, 1, 0);
	КонецЦикла;
	Состояние = СтрШаблон(НСтр("ru = 'Должников: %1, можно написать сейчас: %2.'"), Должники.Количество(), Можно);

КонецПроцедуры

&НаКлиенте
Процедура ОбновитьПредпросмотр()

	ОбновитьПредпросмотрНаСервере();

КонецПроцедуры

//Письмо текущей строки так, как оно уйдёт: адреса, тема, текст с подстановками.
&НаСервере
Процедура ОбновитьПредпросмотрНаСервере()

	ТекущаяСтрока = ?(Элементы.Должники.ТекущаяСтрока = Неопределено, Неопределено,
		Должники.НайтиПоИдентификатору(Элементы.Должники.ТекущаяСтрока));
	Если ТекущаяСтрока = Неопределено И Должники.Количество() > 0 Тогда
		ТекущаяСтрока = Должники[0];
	КонецЕсли;
	Если ТекущаяСтрока = Неопределено Тогда
		Предпросмотр = НСтр("ru = 'Должников по отбору нет.'");
		Возврат;
	КонецЕсли;
	Должник = Новый Структура("Ученик, Организация, Долг, Предметы, ДнейДолга");
	ЗаполнитьЗначенияСвойств(Должник, ТекущаяСтрока);
	Письмо = Обработки.УЗ_РассылкаДолжникам.ПодготовитьПисьмо(Должник, Тема, ТекстПисьма);
	Предпросмотр = НСтр("ru = 'Кому:'") + " "
		+ ?(Письмо.Адреса.Количество() = 0, НСтр("ru = 'некому — нет e-mail с согласием'"),
		СтрСоединить(Письмо.Адреса, "; ")) + Символы.ПС + НСтр("ru = 'Тема:'") + " " + Письмо.Тема
		+ Символы.ПС + Символы.ПС + Письмо.Текст;

КонецПроцедуры

//Отмеченные строки — фоновому заданию; фоновое задание не запустилось — отправка здесь же (Результат).
&НаСервере
Функция НачатьОтправкуНаСервере()

	Итог = Новый Структура("Задание, АдресРезультата, Результат, Ошибка", Неопределено, "", Неопределено, "");
	Получатели = Новый Массив;
	Для Каждого СтрокаДолжника Из Должники Цикл
		Если СтрокаДолжника.Отметка Тогда
			Получатели.Добавить(
				Новый Структура("Ученик, Организация", СтрокаДолжника.Ученик, СтрокаДолжника.Организация));
		КонецЕсли;
	КонецЦикла;
	Если Получатели.Количество() = 0 Тогда
		Итог.Ошибка = НСтр("ru = 'Отметьте должников, которым отправить письмо.'");
		Возврат Итог;
	КонецЕсли;
	Если ПустаяСтрока(ТекстПисьма) Или ПустаяСтрока(Тема) Тогда
		Итог.Ошибка = НСтр("ru = 'Заполните тему и текст письма.'");
		Возврат Итог;
	КонецЕсли;
	Итог.Ошибка = Обработки.УЗ_РассылкаДолжникам.ПричинаНевозможностиОтправки();
	Если Не ПустаяСтрока(Итог.Ошибка) Тогда
		Возврат Итог;
	КонецЕсли;
	ПараметрыОтправки = Новый Массив;
	ПараметрыОтправки.Добавить(Получатели);
	ПараметрыОтправки.Добавить(Тема);
	ПараметрыОтправки.Добавить(ТекстПисьма);
	ПараметрыОтправки.Добавить(НеЧащеДней);
	Запуск = УЗ_Общий.ЗапуститьФоновоеЗадание("УЗ_Почта.ОтправитьПисьмаДолжникамВФоне", ПараметрыОтправки,
		УникальныйИдентификатор, НСтр("ru = 'Учёт занятий: рассылка должникам'"));
	Если Запуск = Неопределено Тогда
		Итог.Результат = Обработки.УЗ_РассылкаДолжникам.ОтправитьПисьма(Получатели, Тема, ТекстПисьма, НеЧащеДней);
	Иначе
		ЗаполнитьЗначенияСвойств(Итог, Запуск);
	КонецЕсли;
	Возврат Итог;

КонецФункции

//Опрос фонового задания раз в секунду; по завершении — результат по строкам.
&НаКлиенте
Процедура ПроверитьЗаданиеРассылки()

	Итог = СостояниеЗаданияНаСервере(ЗаданиеРассылки, АдресРезультата);
	Если Не Итог.Завершено Тогда
		Состояние = СтрШаблон(НСтр("ru = 'Отправляем письма… %1 с'"),
			Окр((ТекущаяУниверсальнаяДатаВМиллисекундах() - НачалоОжидания) / 1000));
		ПодключитьОбработчикОжидания("ПроверитьЗаданиеРассылки", 1, Истина);
		Возврат;
	КонецЕсли;
	ЗаданиеРассылки = Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000");
	Элементы.ФормаОтправить.Доступность = Истина;
	ПоказатьРезультат(Итог.Результат, Итог.Ошибка);

КонецПроцедуры

&НаСервереБезКонтекста
Функция СостояниеЗаданияНаСервере(Знач Задание, Знач Адрес)

	Возврат УЗ_Общий.СостояниеДлительнойОперации(Задание, Адрес);

КонецФункции

//Результат рассылки — в колонку «Результат» строк, отметка снимается с отправленных; итог — в «Состояние».
&НаСервере
Процедура ПоказатьРезультат(Знач Результаты, Знач Ошибка)

	Если Не ПустаяСтрока(Ошибка) Или ТипЗнч(Результаты) <> Тип("Массив") Тогда
		Состояние = НСтр("ru = 'Рассылка не выполнена:'") + " "
			+ ?(ПустаяСтрока(Ошибка), НСтр("ru = 'нет результата'"), Ошибка);
		Элементы.Состояние.ЦветТекста = УЗ_ОбщийКлиентСервер.ЦветМинусаДенег();
		Возврат;
	КонецЕсли;
	Отправлено = 0;
	Для Каждого Результат Из Результаты Цикл
		Для Каждого СтрокаДолжника Из Должники.НайтиСтроки(Новый Структура("Ученик, Организация", Результат.Ученик,
			Результат.Организация)) Цикл
			СтрокаДолжника.Результат = Результат.Результат;
			Если Результат.Отправлено Тогда
				СтрокаДолжника.Отметка = Ложь;
				СтрокаДолжника.МожноПисать = Ложь;
				СтрокаДолжника.ПоследнееПисьмо = ТекущаяДатаСеанса();
				СтрокаДолжника.Долг = Результат.Сумма;
			КонецЕсли;
		КонецЦикла;
		Отправлено = Отправлено + ?(Результат.Отправлено, 1, 0);
	КонецЦикла;
	Состояние =
		СтрШаблон(НСтр(
		"ru = 'Отправлено писем: %1 из %2. Итог по каждому — в колонке «Результат», все письма — в журнале писем.'"),
		Отправлено, Результаты.Количество());
	Элементы.Состояние.ЦветТекста = ?(Отправлено = Результаты.Количество(), УЗ_ОбщийКлиентСервер.ЦветПояснения(),
		УЗ_ОбщийКлиентСервер.ЦветМинусаДенег());

КонецПроцедуры

#КонецОбласти
